garyPenhook/PIC-Assembler/Microchip.PIC18F-Q_DFP.1.28.451.atpack_FILES/edc/PIC18F45Q43.PIC
        <edc:SFRDef edc:access="---nnnnn" edc:cname="T4INPPS" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---uuuuu" edc:name="T4INPPS" edc:nzwidth="8" edc:por="---10101" edc:_modsrc="DOS-xxxx_pps_mid_v3_input_Q43_8bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x3f" edc:_addr="0x249">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PIN" edc:mask="0x7" edc:name="PIN" edc:nzwidth="0x3"/>
              <edc:SFRFieldDef edc:cname="PORT" edc:mask="0x3" edc:name="PORT" edc:nzwidth="2"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="T4INPPS0" edc:mask="0x1" edc:name="T4INPPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T4INPPS1" edc:mask="0x1" edc:name="T4INPPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T4INPPS2" edc:mask="0x1" edc:name="T4INPPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T4INPPS3" edc:mask="0x1" edc:name="T4INPPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T4INPPS4" edc:mask="0x1" edc:name="T4INPPS0" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="T4INPPS" edc:mask="0x1f" edc:name="T4INPPS" edc:nzwidth="5"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="T6INPPS" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---uuuuu" edc:name="T6INPPS" edc:nzwidth="8" edc:por="---01111" edc:_modsrc="DOS-xxxx_pps_mid_v3_input_Q43_8bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x3f" edc:_addr="0x24A">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PIN" edc:mask="0x7" edc:name="PIN" edc:nzwidth="0x3"/>
              <edc:SFRFieldDef edc:cname="PORT" edc:mask="0x3" edc:name="PORT" edc:nzwidth="2"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="T6INPPS0" edc:mask="0x1" edc:name="T6INPPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T6INPPS1" edc:mask="0x1" edc:name="T6INPPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T6INPPS2" edc:mask="0x1" edc:name="T6INPPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T6INPPS3" edc:mask="0x1" edc:name="T6INPPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T6INPPS4" edc:mask="0x1" edc:name="T6INPPS0" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="T6INPPS" edc:mask="0x1f" edc:name="T6INPPS" edc:nzwidth="5"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="0x4" edc:_modsrc="DOS-xxxx_pps_mid_v3_input_Q43_8bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x3f" edc:_addr="0x24B"/>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="CCP1PPS" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--uuuuuu" edc:name="CCP1PPS" edc:nzwidth="8" edc:por="--010010" edc:_modsrc="DOS-xxxx_pps_mid_v3_input_Q43_8bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x3f" edc:_addr="0x24F">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PIN" edc:mask="0x7" edc:name="PIN" edc:nzwidth="0x3"/>
              <edc:SFRFieldDef edc:cname="PORT" edc:mask="0x7" edc:name="PORT" edc:nzwidth="3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="CCP1PPS0" edc:mask="0x1" edc:name="CCP1PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CCP1PPS1" edc:mask="0x1" edc:name="CCP1PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CCP1PPS2" edc:mask="0x1" edc:name="CCP1PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CCP1PPS3" edc:mask="0x1" edc:name="CCP1PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CCP1PPS4" edc:mask="0x1" edc:name="CCP1PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CCP1PPS5" edc:mask="0x1" edc:name="CCP1PPS5" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="CCP1PPS" edc:mask="0x3f" edc:name="CCP1PPS" edc:nzwidth="6"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="CCP2PPS" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--uuuuuu" edc:name="CCP2PPS" edc:nzwidth="8" edc:por="--010001" edc:_modsrc="DOS-xxxx_pps_mid_v3_input_Q43_8bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x3f" edc:_addr="0x250">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PIN" edc:mask="0x7" edc:name="PIN" edc:nzwidth="0x3"/>
              <edc:SFRFieldDef edc:cname="PORT" edc:mask="0x7" edc:name="PORT" edc:nzwidth="3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="CCP2PPS0" edc:mask="0x1" edc:name="CCP2PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CCP2PPS1" edc:mask="0x1" edc:name="CCP2PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CCP2PPS2" edc:mask="0x1" edc:name="CCP2PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CCP2PPS3" edc:mask="0x1" edc:name="CCP2PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CCP2PPS4" edc:mask="0x1" edc:name="CCP2PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CCP2PPS5" edc:mask="0x1" edc:name="CCP2PPS5" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="CCP2PPS" edc:mask="0x3f" edc:name="CCP2PPS" edc:nzwidth="6"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="CCP3PPS" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---uuuuu" edc:name="CCP3PPS" edc:nzwidth="8" edc:por="---10001" edc:_modsrc="DOS-xxxx_pps_mid_v3_input_Q43_8bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x3f" edc:_addr="0x251">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PIN" edc:mask="0x7" edc:name="PIN" edc:nzwidth="0x3"/>
              <edc:SFRFieldDef edc:cname="PORT" edc:mask="0x3" edc:name="PORT" edc:nzwidth="2"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="CCP3PPS0" edc:mask="0x1" edc:name="CCP3PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CCP3PPS1" edc:mask="0x1" edc:name="CCP3PPS1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CCP3PPS2" edc:mask="0x1" edc:name="CCP3PPS2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CCP3PPS3" edc:mask="0x1" edc:name="CCP3PPS3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CCP3PPS4" edc:mask="0x1" edc:name="CCP3PPS4" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="CCP3PPS" edc:mask="0x1f" edc:name="CCP3PPS" edc:nzwidth="5"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
