garyPenhook/PIC-Assembler/Microchip.PIC18F-Q_DFP.1.28.451.atpack_FILES/edc/PIC18F45Q43.PIC
        <edc:AdjustPoint edc:offset="1" edc:_addr="0x2B5"/>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="U2TXB" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="U2TXB" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-03076_uart_protocol_0_v1.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x13" edc:_addr="0x2B6">
          <edc:AliasList>
            <edc:MigrationAlias edc:cname="U2TXBL"/>
          </edc:AliasList>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TXB" edc:desc="" edc:mask="0xff" edc:name="TXB" edc:nzwidth="8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="1" edc:_addr="0x2B7"/>
        <edc:JoinedSFRDef edc:cname="U2P1" edc:desc="" edc:name="U2P1" edc:nzwidth="0x10" edc:_modsrc="DOS-03076_uart_protocol_0_v1.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x13" edc:_addr="0x2B8">
          <edc:SFRModeList/>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="U2P1L" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="U2P1L" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-03076_uart_protocol_0_v1.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x13" edc:_addr="0x2B8">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="P1L" edc:desc="" edc:mask="0xff" edc:name="P1L" edc:nzwidth="8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
          <edc:AdjustPoint edc:offset="1" edc:_addr="0x2B9"/>
        </edc:JoinedSFRDef>
        <edc:JoinedSFRDef edc:cname="U2P2" edc:desc="" edc:name="U2P2" edc:nzwidth="0x10" edc:_modsrc="DOS-03076_uart_protocol_0_v1.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x13" edc:_addr="0x2BA">
          <edc:SFRModeList/>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="U2P2L" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="U2P2L" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-03076_uart_protocol_0_v1.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x13" edc:_addr="0x2BA">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="P2L" edc:desc="" edc:mask="0xff" edc:name="P2L" edc:nzwidth="8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
          <edc:AdjustPoint edc:offset="1" edc:_addr="0x2BB"/>
        </edc:JoinedSFRDef>
        <edc:JoinedSFRDef edc:cname="U2P3" edc:desc="" edc:name="U2P3" edc:nzwidth="0x10" edc:_modsrc="DOS-03076_uart_protocol_0_v1.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x13" edc:_addr="0x2BC">
          <edc:SFRModeList/>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="U2P3L" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxx" edc:name="U2P3L" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_modsrc="DOS-03076_uart_protocol_0_v1.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x13" edc:_addr="0x2BC">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="P3L" edc:desc="" edc:mask="0xff" edc:name="P3L" edc:nzwidth="8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
          <edc:AdjustPoint edc:offset="1" edc:_addr="0x2BD"/>
        </edc:JoinedSFRDef>
        <edc:SFRDef edc:access="nnnn-nnn" edc:cname="U2CON0" edc:desc="" edc:impl="0xf7" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000-000" edc:name="U2CON0" edc:nzwidth="8" edc:por="0000-000" edc:_modsrc="DOS-03076_uart_protocol_0_v1.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x13" edc:_addr="0x2BE">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="MODE0" edc:desc="" edc:mask="0x1" edc:name="MODE0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MODE1" edc:desc="" edc:mask="0x1" edc:name="MODE1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MODE2" edc:desc="" edc:mask="0x1" edc:name="MODE2" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="U2MODE" edc:desc="" edc:mask="0x7" edc:name="U2MODE" edc:nzwidth="4"/>
              <edc:SFRFieldDef edc:cname="U2RXEN" edc:desc="" edc:mask="0x1" edc:name="U2RXEN" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="U2TXEN" edc:desc="" edc:mask="0x1" edc:name="U2TXEN" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="U2ABDEN" edc:desc="" edc:mask="0x1" edc:name="U2ABDEN" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="U2BRGS" edc:desc="" edc:mask="0x1" edc:name="U2BRGS" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="U2MODE0" edc:desc="" edc:mask="0x1" edc:name="U2MODE0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="U2MODE1" edc:desc="" edc:mask="0x1" edc:name="U2MODE1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="U2MODE2" edc:desc="" edc:mask="0x1" edc:name="U2MODE2" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="MODE" edc:desc="" edc:mask="0x7" edc:name="MODE" edc:nzwidth="4"/>
              <edc:SFRFieldDef edc:cname="RXEN" edc:desc="" edc:mask="0x1" edc:name="RXEN" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXEN" edc:desc="" edc:mask="0x1" edc:name="TXEN" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ABDEN" edc:desc="" edc:mask="0x1" edc:name="ABDEN" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="BRGS" edc:desc="" edc:mask="0x1" edc:name="BRGS" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="n--nn-nn" edc:cname="U2CON1" edc:desc="" edc:impl="0x9b" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0--00-00" edc:name="U2CON1" edc:nzwidth="8" edc:por="0--00-00" edc:_modsrc="DOS-03076_uart_protocol_0_v1.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x13" edc:_addr="0x2BF">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SENDB" edc:desc="" edc:mask="0x1" edc:name="SENDB" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="BRKOVR" edc:desc="" edc:mask="0x1" edc:name="BRKOVR" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="RXBIMD" edc:desc="" edc:mask="0x1" edc:name="RXBIMD" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="WUE" edc:desc="" edc:mask="0x1" edc:name="WUE" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="ON" edc:desc="" edc:mask="0x1" edc:name="ON" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="U2SENDB" edc:desc="" edc:mask="0x1" edc:name="U2SENDB" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="U2BRKOVR" edc:desc="" edc:mask="0x1" edc:name="U2BRKOVR" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="U2RXBIMD" edc:desc="" edc:mask="0x1" edc:name="U2RXBIMD" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="U2WUE" edc:desc="" edc:mask="0x1" edc:name="U2WUE" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="U2ON" edc:desc="" edc:mask="0x1" edc:name="U2ON" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnn-nnn" edc:cname="U2CON2" edc:desc="" edc:impl="0xf7" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000-000" edc:name="U2CON2" edc:nzwidth="8" edc:por="0000-000" edc:_modsrc="DOS-03076_uart_protocol_0_v1.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x13" edc:_addr="0x2C0">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="FLO" edc:desc="" edc:mask="0x3" edc:name="FLO" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="TXPOL" edc:desc="" edc:mask="0x1" edc:name="TXPOL" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="STP" edc:desc="" edc:mask="0x3" edc:name="STP" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="RXPOL" edc:desc="" edc:mask="0x1" edc:name="RXPOL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RUNOVF" edc:desc="" edc:mask="0x1" edc:name="RUNOVF" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="FLO0" edc:desc="" edc:mask="0x1" edc:name="FLO0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FLO1" edc:desc="" edc:mask="0x1" edc:name="FLO1" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="STP0" edc:desc="" edc:mask="0x1" edc:name="STP0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="STP1" edc:desc="" edc:mask="0x1" edc:name="STP1" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="U2FLO" edc:desc="" edc:mask="0x3" edc:name="U2FLO" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="U2TXPOL" edc:desc="" edc:mask="0x1" edc:name="U2TXPOL" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="U2STP" edc:desc="" edc:mask="0x3" edc:name="U2STP" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="U2RXPOL" edc:desc="" edc:mask="0x1" edc:name="U2RXPOL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="U2RUNOVF" edc:desc="" edc:mask="0x1" edc:name="U2RUNOVF" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="U2FLO0" edc:desc="" edc:mask="0x1" edc:name="U2FLO0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="U2FLO1" edc:desc="" edc:mask="0x1" edc:name="U2FLO1" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="U2STP0" edc:desc="" edc:mask="0x1" edc:name="U2STP0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="U2STP1" edc:desc="" edc:mask="0x1" edc:name="U2STP1" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
