garyPenhook/PIC-Assembler/Microchip.PIC18F-Q_DFP.1.28.451.atpack_FILES/edc/PIC18F45Q43.PIC
        <edc:JoinedSFRDef edc:cname="ADSTPT" edc:desc="" edc:name="ADSTPT" edc:nzwidth="0x10" edc:_modsrc="DOS-03191_adc_sarcore_mp_ctrl_v2_generic.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x22" edc:_addr="0x3DF">
          <edc:SFRModeList/>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="ADSTPTL" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="ADSTPTL" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-03191_adc_sarcore_mp_ctrl_v2_generic.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x22" edc:_addr="0x3DF">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="STPT" edc:desc="" edc:mask="0xff" edc:name="STPT" edc:nzwidth="8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="ADSTPT0" edc:desc="" edc:mask="0x1" edc:name="ADSTPT0" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ADSTPT1" edc:desc="" edc:mask="0x1" edc:name="ADSTPT1" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ADSTPT2" edc:desc="" edc:mask="0x1" edc:name="ADSTPT2" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ADSTPT3" edc:desc="" edc:mask="0x1" edc:name="ADSTPT3" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ADSTPT4" edc:desc="" edc:mask="0x1" edc:name="ADSTPT4" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ADSTPT5" edc:desc="" edc:mask="0x1" edc:name="ADSTPT5" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ADSTPT6" edc:desc="" edc:mask="0x1" edc:name="ADSTPT6" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ADSTPT7" edc:desc="" edc:mask="0x1" edc:name="ADSTPT7" edc:nzwidth="1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.1">
                <edc:SFRFieldDef edc:cname="ADSTPT" edc:mask="0xff" edc:name="ADSTPT" edc:nzwidth="0x8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.2">
                <edc:SFRFieldDef edc:cname="STPT0" edc:mask="0x1" edc:name="STPT0" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="STPT1" edc:mask="0x1" edc:name="STPT1" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="STPT2" edc:mask="0x1" edc:name="STPT2" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="STPT3" edc:mask="0x1" edc:name="STPT3" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="STPT4" edc:mask="0x1" edc:name="STPT4" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="STPT5" edc:mask="0x1" edc:name="STPT5" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="STPT6" edc:mask="0x1" edc:name="STPT6" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="STPT7" edc:mask="0x1" edc:name="STPT7" edc:nzwidth="0x1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="ADSTPTH" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="ADSTPTH" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-03191_adc_sarcore_mp_ctrl_v2_generic.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x22" edc:_addr="0x3E0">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="STPT" edc:desc="" edc:mask="0xff" edc:name="STPT" edc:nzwidth="8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="ADSTPT8" edc:desc="" edc:mask="0x1" edc:name="ADSTPT8" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ADSTPT9" edc:desc="" edc:mask="0x1" edc:name="ADSTPT9" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ADSTPT10" edc:desc="" edc:mask="0x1" edc:name="ADSTPT10" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ADSTPT11" edc:desc="" edc:mask="0x1" edc:name="ADSTPT11" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ADSTPT12" edc:desc="" edc:mask="0x1" edc:name="ADSTPT12" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ADSTPT13" edc:desc="" edc:mask="0x1" edc:name="ADSTPT13" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ADSTPT14" edc:desc="" edc:mask="0x1" edc:name="ADSTPT14" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ADSTPT15" edc:desc="" edc:mask="0x1" edc:name="ADSTPT15" edc:nzwidth="1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.1">
                <edc:SFRFieldDef edc:cname="ADSTPT" edc:mask="0xff" edc:name="ADSTPT" edc:nzwidth="0x8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.2">
                <edc:SFRFieldDef edc:cname="STPT8" edc:mask="0x1" edc:name="STPT8" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="STPT9" edc:mask="0x1" edc:name="STPT9" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="STPT10" edc:mask="0x1" edc:name="STPT10" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="STPT11" edc:mask="0x1" edc:name="STPT11" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="STPT12" edc:mask="0x1" edc:name="STPT12" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="STPT13" edc:mask="0x1" edc:name="STPT13" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="STPT15" edc:mask="0x1" edc:name="STPT15" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="STPT16" edc:mask="0x1" edc:name="STPT16" edc:nzwidth="0x1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
        <edc:JoinedSFRDef edc:cname="ADFLTR" edc:desc="" edc:name="ADFLTR" edc:nzwidth="0x10" edc:_modsrc="DOS-03191_adc_sarcore_mp_ctrl_v2_generic.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x22" edc:_addr="0x3E1">
          <edc:SFRModeList/>
          <edc:SFRDef edc:access="rrrrrrrr" edc:cname="ADFLTRL" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxx" edc:name="ADFLTRL" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_modsrc="DOS-03191_adc_sarcore_mp_ctrl_v2_generic.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x22" edc:_addr="0x3E1">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="FLTR" edc:desc="" edc:mask="0xff" edc:name="FLTR" edc:nzwidth="8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="ADFLTR0" edc:desc="" edc:mask="0x1" edc:name="ADFLTR0" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ADFLTR1" edc:desc="" edc:mask="0x1" edc:name="ADFLTR1" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ADFLTR2" edc:desc="" edc:mask="0x1" edc:name="ADFLTR2" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ADFLTR3" edc:desc="" edc:mask="0x1" edc:name="ADFLTR3" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ADFLTR4" edc:desc="" edc:mask="0x1" edc:name="ADFLTR4" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ADFLTR5" edc:desc="" edc:mask="0x1" edc:name="ADFLTR5" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ADFLTR6" edc:desc="" edc:mask="0x1" edc:name="ADFLTR6" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ADFLTR7" edc:desc="" edc:mask="0x1" edc:name="ADFLTR7" edc:nzwidth="1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.1">
                <edc:SFRFieldDef edc:cname="ADFLTR" edc:mask="0xff" edc:name="ADFLTR" edc:nzwidth="0x8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.2">
                <edc:SFRFieldDef edc:cname="FLTR0" edc:mask="0x1" edc:name="FLTR0" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="FLTR1" edc:mask="0x1" edc:name="FLTR1" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="FLTR2" edc:mask="0x1" edc:name="FLTR2" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="FLTR3" edc:mask="0x1" edc:name="FLTR3" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="FLTR4" edc:mask="0x1" edc:name="FLTR4" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="FLTR5" edc:mask="0x1" edc:name="FLTR5" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="FLTR6" edc:mask="0x1" edc:name="FLTR6" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="FLTR7" edc:mask="0x1" edc:name="FLTR7" edc:nzwidth="0x1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
