garyPenhook/PIC-Assembler/Microchip.PIC18F-Q_DFP.1.28.451.atpack_FILES/edc/PIC18F45Q43.PIC
        <edc:JoinedSFRDef edc:cname="ADPREV" edc:desc="" edc:name="ADPREV" edc:nzwidth="0x10" edc:_modsrc="DOS-03191_adc_sarcore_mp_ctrl_v2_generic.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x22" edc:_addr="0x3E8">
          <edc:SFRModeList/>
          <edc:SFRDef edc:access="rrrrrrrr" edc:cname="ADPREVL" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxx" edc:name="ADPREVL" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_modsrc="DOS-03191_adc_sarcore_mp_ctrl_v2_generic.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x22" edc:_addr="0x3E8">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="PREV" edc:desc="" edc:mask="0xff" edc:name="PREV" edc:nzwidth="8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="ADPREV0" edc:desc="" edc:mask="0x1" edc:name="ADPREV0" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ADPREV1" edc:desc="" edc:mask="0x1" edc:name="ADPREV1" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ADPREV2" edc:desc="" edc:mask="0x1" edc:name="ADPREV2" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ADPREV3" edc:desc="" edc:mask="0x1" edc:name="ADPREV3" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ADPREV4" edc:desc="" edc:mask="0x1" edc:name="ADPREV4" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ADPREV5" edc:desc="" edc:mask="0x1" edc:name="ADPREV5" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ADPREV6" edc:desc="" edc:mask="0x1" edc:name="ADPREV6" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ADPREV7" edc:desc="" edc:mask="0x1" edc:name="ADPREV7" edc:nzwidth="1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.1">
                <edc:SFRFieldDef edc:cname="ADPREV" edc:mask="0xff" edc:name="ADPREV" edc:nzwidth="0x8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.2">
                <edc:SFRFieldDef edc:cname="PREV0" edc:mask="0x1" edc:name="PREV0" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="PREV1" edc:mask="0x1" edc:name="PREV1" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="PREV2" edc:mask="0x1" edc:name="PREV2" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="PREV3" edc:mask="0x1" edc:name="PREV3" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="PREV4" edc:mask="0x1" edc:name="PREV4" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="PREV5" edc:mask="0x1" edc:name="PREV5" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="PREV6" edc:mask="0x1" edc:name="PREV6" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="PREV7" edc:mask="0x1" edc:name="PREV7" edc:nzwidth="0x1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
          <edc:SFRDef edc:access="rrrrrrrr" edc:cname="ADPREVH" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxx" edc:name="ADPREVH" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_modsrc="DOS-03191_adc_sarcore_mp_ctrl_v2_generic.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x22" edc:_addr="0x3E9">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="PREV" edc:desc="" edc:mask="0xff" edc:name="PREV" edc:nzwidth="8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="ADPREV8" edc:desc="" edc:mask="0x1" edc:name="ADPREV8" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ADPREV9" edc:desc="" edc:mask="0x1" edc:name="ADPREV9" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ADPREV10" edc:desc="" edc:mask="0x1" edc:name="ADPREV10" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ADPREV11" edc:desc="" edc:mask="0x1" edc:name="ADPREV11" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ADPREV12" edc:desc="" edc:mask="0x1" edc:name="ADPREV12" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ADPREV13" edc:desc="" edc:mask="0x1" edc:name="ADPREV13" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ADPREV14" edc:desc="" edc:mask="0x1" edc:name="ADPREV14" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ADPREV15" edc:desc="" edc:mask="0x1" edc:name="ADPREV15" edc:nzwidth="1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.1">
                <edc:SFRFieldDef edc:cname="ADPREV" edc:mask="0xff" edc:name="ADPREV" edc:nzwidth="0x8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.2">
                <edc:SFRFieldDef edc:cname="PREV8" edc:mask="0x1" edc:name="PREV8" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="PREV9" edc:mask="0x1" edc:name="PREV9" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="PREV10" edc:mask="0x1" edc:name="PREV10" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="PREV11" edc:mask="0x1" edc:name="PREV11" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="PREV12" edc:mask="0x1" edc:name="PREV12" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="PREV13" edc:mask="0x1" edc:name="PREV13" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="PREV14" edc:mask="0x1" edc:name="PREV14" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="PREV15" edc:mask="0x1" edc:name="PREV15" edc:nzwidth="0x1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
        <edc:JoinedSFRDef edc:cname="ADRES" edc:desc="" edc:name="ADRES" edc:nzwidth="0x10" edc:_modsrc="DOS-03191_adc_sarcore_mp_ctrl_v2_generic.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x22" edc:_addr="0x3EA">
          <edc:SFRModeList/>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="ADRESL" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="ADRESL" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-03191_adc_sarcore_mp_ctrl_v2_generic.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x22" edc:_addr="0x3EA">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="RES" edc:desc="" edc:mask="0xff" edc:name="RES" edc:nzwidth="8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="ADRES0" edc:mask="0x1" edc:name="ADRES0" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="ADRES1" edc:mask="0x1" edc:name="ADRES0" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="ADRES2" edc:mask="0x1" edc:name="ADRES0" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="ADRES3" edc:mask="0x1" edc:name="ADRES0" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="ADRES4" edc:mask="0x1" edc:name="ADRES0" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="ADRES5" edc:mask="0x1" edc:name="ADRES0" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="ADRES6" edc:mask="0x1" edc:name="ADRES0" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="ADRES7" edc:mask="0x1" edc:name="ADRES0" edc:nzwidth="0x1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.1">
                <edc:SFRFieldDef edc:cname="ADRES" edc:mask="0xff" edc:name="ADRES" edc:nzwidth="0x8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.2">
                <edc:SFRFieldDef edc:cname="RES0" edc:mask="0x1" edc:name="RES0" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="RES1" edc:mask="0x1" edc:name="RES1" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="RES2" edc:mask="0x1" edc:name="RES2" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="RES3" edc:mask="0x1" edc:name="RES3" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="RES4" edc:mask="0x1" edc:name="RES4" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="RES5" edc:mask="0x1" edc:name="RES5" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="RES6" edc:mask="0x1" edc:name="RES6" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="RES7" edc:mask="0x1" edc:name="RES7" edc:nzwidth="0x1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="ADRESH" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="ADRESH" edc:nzwidth="0x8" edc:por="00000000" edc:_modsrc="DOS-03191_adc_sarcore_mp_ctrl_v2_generic.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x22" edc:_addr="0x3EB">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="RES" edc:desc="" edc:islanghidden="true" edc:mask="0xff" edc:name="RES" edc:nzwidth="0x8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="ADRES8" edc:mask="0x1" edc:name="ADRES8" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="ADRES9" edc:mask="0x1" edc:name="ADRES9" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="ADRES10" edc:mask="0x1" edc:name="ADRES10" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="ADRES11" edc:mask="0x1" edc:name="ADRES11" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="ADRES12" edc:mask="0x1" edc:name="ADRES12" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="ADRES13" edc:mask="0x1" edc:name="ADRES13" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="ADRES14" edc:mask="0x1" edc:name="ADRES14" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="ADRES15" edc:mask="0x1" edc:name="ADRES15" edc:nzwidth="0x1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.1">
                <edc:SFRFieldDef edc:cname="ADRES" edc:mask="0xff" edc:name="ADRES" edc:nzwidth="0x8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.2">
                <edc:SFRFieldDef edc:cname="RES8" edc:mask="0x1" edc:name="RES8" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="RES9" edc:mask="0x1" edc:name="RES9" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="RES10" edc:mask="0x1" edc:name="RES10" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="RES11" edc:mask="0x1" edc:name="RES11" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="RES12" edc:mask="0x1" edc:name="RES12" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="RES13" edc:mask="0x1" edc:name="RES13" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="RES14" edc:mask="0x1" edc:name="RES14" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="RES15" edc:mask="0x1" edc:name="RES15" edc:nzwidth="0x1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
            <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Integer"/>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="ADPCH" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--000000" edc:name="ADPCH" edc:nzwidth="8" edc:por="--000000" edc:_modsrc="DOS-03191_adc_sarcore_mp_ctrl_v2_generic.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x22" edc:_addr="0x3EC">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PCH" edc:desc="" edc:mask="0x3f" edc:name="PCH" edc:nzwidth="8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="ADPCH0" edc:desc="" edc:mask="0x1" edc:name="ADPCH0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ADPCH1" edc:desc="" edc:mask="0x1" edc:name="ADPCH1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ADPCH2" edc:desc="" edc:mask="0x1" edc:name="ADPCH2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ADPCH3" edc:desc="" edc:mask="0x1" edc:name="ADPCH3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ADPCH4" edc:desc="" edc:mask="0x1" edc:name="ADPCH4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ADPCH5" edc:desc="" edc:mask="0x1" edc:name="ADPCH5" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
